package com.ww.StringTest;

public class StringTest {

    public static void main(String[] args) {
        //1 长度

        //2 是否为空

        //3 某个下表的字符

        //4 转换编码格式

        //5 相等

        //6 不区分大小写的相等

        //7 comparator接口返回int值的写法

        //8 以。。开头

        //9 以。。结尾

        //10 某个字符/数字的下标

        //11 某个字符/数字的最后一个下标

        //12 从某个下标截取

        //13 从某个下标截取一个长度

        //14 拼接字符串

        //15 替换某个字符

        //16 替换收割字符

        //17 替换全部字符

        //18 是否符合某个表达式matches

        //19 是否包含另外一个字符串

        //20 把某个字符串替换为另外一个字符串

        //21 把字符串按某个符号切割成数组

        //22 拼接多个字符串

        //23 转换成小写

        //24 转换成大写

        //25 去除空格

        //26 字符串转换成字符数组

        //27 转换成某个格式，多用于日期转换

        //28 字符数组  布尔 long float double转换成字符串






    }

}
